<script>
  export default {
    name: 'About'
  }
</script>

<template>
  <link href="https://fonts.googleapis.com/css2?family=Noto+Sans:ital,wght@0,100..900;1,100..900&family=Sofia+Sans:ital,wght@0,1..1000;1,1..1000&display=swap" rel="stylesheet">
  <div class="container">
    
    <h1 class="line">О компании (текст-заполнитель)</h1>
    <hr />
    <h3>Добро пожаловать в "Online Shop" — Ваш онлайн-магазин!</h3>

    <p>В нашем интернет-магазине "Online Shop" мы стремимся сделать вашу жизнь проще и комфортнее, предлагая широкий ассортимент товаров для дома, семьи и отдыха. Мы понимаем, как важно находить качественные продукты по разумным ценам, и поэтому тщательно отбираем каждую позицию в нашем каталоге.</p>
    <hr />
    <h3>Наши категории товаров</h3>

    <p>1. Кухонные принадлежности:</p>
    <p>В нашем разделе кухонных принадлежностей вы найдете все необходимое для создания кулинарных шедевров. Мы предлагаем посуду, ножи, кастрюли и сковородки от известных брендов, а также аксессуары для сервировки и хранения продуктов. Наши товары помогут вам готовить с удовольствием и без лишних хлопот.</p>

    <p>2. Товары для дома:</p>
    <p>Создайте уют в вашем доме с помощью нашей коллекции текстиля, декора и мебели. Мы предлагаем стильные подушки, пледы, шторы и ковры, которые добавят тепло и индивидуальность вашему интерьеру. Также в нашем ассортименте вы найдете функциональную мебель для хранения вещей и организации пространства.</p>

    <p>3. Уход за собой:</p>
    <p>Заботьтесь о себе с нашими товарами для личной гигиены и косметики. В этом разделе вы найдете широкий выбор средств по уходу за кожей, волосами и телом от популярных брендов. Мы также предлагаем органическую косметику и натуральные средства, чтобы вы могли заботиться о себе с любовью.</p>

    <p>4. Товары для детей:</p>
    <p>У нас есть все необходимое для ваших маленьких чудес! В нашем разделе товаров для детей вы найдете игрушки, одежду, аксессуары для ухода и обучения. Мы тщательно отбираем товары, чтобы гарантировать их безопасность и качество.</p>

    <p>5. Спорт и активный отдых:</p>
    <p>Для любителей активного образа жизни мы предлагаем спортивное снаряжение, одежду и аксессуары. Независимо от того, занимаетесь ли вы фитнесом, бегом или просто гуляете на свежем воздухе, у нас есть все необходимое для комфортных тренировок.</p>
    <hr />
    <h3>Почему выбирают нас?</h3>

    <p>• Качество: Мы работаем только с проверенными поставщиками и брендами, чтобы гарантировать высокое качество всех наших товаров.</p>

    <p>• Доступные цены: Мы стремимся предложить нашим клиентам лучшие цены на рынке. Регулярные акции и скидки позволят вам экономить на покупках.</p>

    <p>• Удобство покупок: Наш сайт интуитивно понятен и удобен в использовании. Вы можете легко найти нужные товары, сравнить их и оформить заказ всего в несколько кликов.</p>

    <p>• Быстрая доставка: Мы понимаем, как важно получать свои покупки вовремя. Поэтому мы предлагаем быструю доставку по всей стране.</p>

    <p>• Отличное обслуживание: Наша команда поддержки всегда готова помочь вам с любыми вопросами или проблемами. Мы ценим каждого клиента и стремимся обеспечить высокий уровень сервиса.</p>
    <hr />
    <h3>Специальные предложения</h3>

    <p>Не пропустите наши специальные предложения и распродажи! Подписывайтесь на нашу рассылку, чтобы первыми узнавать о новых поступлениях и акциях. Также мы регулярно проводим конкурсы и розыгрыши призов среди наших подписчиков.</p>
    <hr />
    <h3>Заключение</h3>

    <p>В "Online Shop" мы уверены, что каждый найдет здесь что-то для себя. Мы работаем для вас и рады предложить лучший сервис и качественные товары. Начните свой шопинг прямо сейчас — откройте для себя мир удобства и комфорта с нашим интернет-магазином!</p>
  </div>
</template>

<style scoped>
  .container {
    max-width: 65vw;
    margin: 0px auto;
    padding: 20px 0px 40px 0px;
    background-color: #e0ebf7;
    filter: drop-shadow(0 0.2rem 0.25rem rgba(0, 0, 0, 0.2));
  }

  h1, h3, p {
    font-family: "Sofia Sans", serif;
    font-optical-sizing: auto;
    font-weight: 500;
    font-style: normal;
    color: #1c2633;
  }

  h1 {
    font-size: 26px;
    line-height: 36px;
    padding: 20px 10px;
  }

  h3 {
    font-size: 22px;
    line-height: 30px;
    padding: 15px 10px;
  }

  p {
    font-size: 18px;
    line-height: 28px;
    padding: 0px 10px;
  }

  .line {
    background-image: linear-gradient(rgba(255, 255, 255, 0.1), rgba(255, 255, 255, 0.9), rgba(255, 255, 255, 0.1));
  }

  hr {
    border: none;
    border-top: 1px solid rgba(0,0,0,0.08);
    margin-top: 20px;
  }

</style>
